# todo: 10.1 Дано целое число A. Проверить истинность высказывания: «Число A является четным».
# todo: 10.2 Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
# Примечание: В задании  требуется вывести логическое значение True, если выражение
# для введеных исходных данных является истинным, и значение False в противном случае.


A_1 = int(input('Ведите число А = '))

num = A_1 % 2 == 0

print(num)

A_2 = int(input('Ведите число А = '))

num = A_2 % 2 == 1

print(num)


